In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'Name': ['Adnan', 'John', 'Salam'],
                  'growth': [.05, 0.1, 1.4]})

inst_df = pd.DataFrame([{'Name': 'Adi', 'inst': 'guitar'},
                        {'inst': 'drums', 'Name': 'Adnan'}])

In [3]:
df

    Name  growth
0  Adnan    0.05
1   John    0.10
2  Salam    1.40

In [4]:
inst_df

    Name    inst
0    Adi  guitar
1  Adnan   drums

In [7]:
pd.concat([df, inst_df])

    Name  growth    inst
0  Adnan    0.05     NaN
1   John    0.10     NaN
2  Salam    1.40     NaN
0    Adi     NaN  guitar
1  Adnan     NaN   drums

In [8]:
pd.concat([df, df]).reset_index() # extra index column added

   index   Name  growth
0      0  Adnan    0.05
1      1   John    0.10
2      2  Salam    1.40
3      0  Adnan    0.05
4      1   John    0.10
5      2  Salam    1.40

In [11]:
df.append(df).reset_index(drop=True)

    Name  growth
0  Adnan    0.05
1   John    0.10
2  Salam    1.40
3  Adnan    0.05
4   John    0.10
5  Salam    1.40

In [10]:
df.append(df, ignore_index=True)

    Name  growth
0  Adnan    0.05
1   John    0.10
2  Salam    1.40
3  Adnan    0.05
4   John    0.10
5  Salam    1.40

In [12]:
df.append(df)

    Name  growth
0  Adnan    0.05
1   John    0.10
2  Salam    1.40
0  Adnan    0.05
1   John    0.10
2  Salam    1.40

In [13]:
df2 = df.append(df)

In [14]:
df2

    Name  growth
0  Adnan    0.05
1   John    0.10
2  Salam    1.40
0  Adnan    0.05
1   John    0.10
2  Salam    1.40

In [15]:
df2.index.is_unique

False

In [17]:
df2.reset_index().index.is_unique

True

In [18]:
df2.iloc[0]

Name      Adnan
growth     0.05
Name: 0, dtype: object

In [19]:
df2.loc[0]

    Name  growth
0  Adnan    0.05
0  Adnan    0.05

In [20]:
df.loc[0]

Name      Adnan
growth     0.05
Name: 0, dtype: object